app/controllers/stanzas_controller.rb

SELECT * FROM `stanzas` WHERE (`stanzas`.`id` = '2') LIMIT 1
---
  def load_stanza
    begin
      @stanza = Stanza.find(params[:id])