app/controllers/welcome_controller.rb

  def index
    @most_recent_stanzas = Stanza.public.published.most_recent.limit(10)
---
SELECT * FROM `stanzas` WHERE ((published_at > '2010-08-27 16:09:36') AND (`stanzas`.`public` = 1))